MikroElektronika/core_packages/PIC/XC8/def/PIC16LF18877/mcu.h
// Register: ADCLK
#define ADCLK ADCLK
extern volatile unsigned char           ADCLK               __at(0x098);
#ifndef _LIB_BUILD
asm("ADCLK equ 098h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCCS                  :6;
    };
    struct {
        unsigned ADCCS0                 :1;
        unsigned ADCCS1                 :1;
        unsigned ADCCS2                 :1;
        unsigned ADCCS3                 :1;
        unsigned ADCCS4                 :1;
        unsigned ADCCS5                 :1;
    };
} ADCLKbits_t;
extern volatile ADCLKbits_t ADCLKbits __at(0x098);
// bitfield macros
#define _ADCLK_ADCCS_POSN                                   0x0
#define _ADCLK_ADCCS_POSITION                               0x0
#define _ADCLK_ADCCS_SIZE                                   0x6
#define _ADCLK_ADCCS_LENGTH                                 0x6
#define _ADCLK_ADCCS_MASK                                   0x3F
#define _ADCLK_ADCCS0_POSN                                  0x0
#define _ADCLK_ADCCS0_POSITION                              0x0
#define _ADCLK_ADCCS0_SIZE                                  0x1
#define _ADCLK_ADCCS0_LENGTH                                0x1
#define _ADCLK_ADCCS0_MASK                                  0x1
#define _ADCLK_ADCCS1_POSN                                  0x1
#define _ADCLK_ADCCS1_POSITION                              0x1
#define _ADCLK_ADCCS1_SIZE                                  0x1
#define _ADCLK_ADCCS1_LENGTH                                0x1
#define _ADCLK_ADCCS1_MASK                                  0x2
#define _ADCLK_ADCCS2_POSN                                  0x2
#define _ADCLK_ADCCS2_POSITION                              0x2
#define _ADCLK_ADCCS2_SIZE                                  0x1
#define _ADCLK_ADCCS2_LENGTH                                0x1
#define _ADCLK_ADCCS2_MASK                                  0x4
#define _ADCLK_ADCCS3_POSN                                  0x3
#define _ADCLK_ADCCS3_POSITION                              0x3
#define _ADCLK_ADCCS3_SIZE                                  0x1
#define _ADCLK_ADCCS3_LENGTH                                0x1
#define _ADCLK_ADCCS3_MASK                                  0x8
#define _ADCLK_ADCCS4_POSN                                  0x4
#define _ADCLK_ADCCS4_POSITION                              0x4
#define _ADCLK_ADCCS4_SIZE                                  0x1
#define _ADCLK_ADCCS4_LENGTH                                0x1
#define _ADCLK_ADCCS4_MASK                                  0x10
#define _ADCLK_ADCCS5_POSN                                  0x5
#define _ADCLK_ADCCS5_POSITION                              0x5
#define _ADCLK_ADCCS5_SIZE                                  0x1
#define _ADCLK_ADCCS5_LENGTH                                0x1
#define _ADCLK_ADCCS5_MASK                                  0x20

// Register: ADACT
#define ADACT ADACT
extern volatile unsigned char           ADACT               __at(0x099);
#ifndef _LIB_BUILD
asm("ADACT equ 099h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADACT                  :5;
    };
    struct {
        unsigned ADACT0                 :1;
        unsigned ADACT1                 :1;
        unsigned ADACT2                 :1;
        unsigned ADACT3                 :1;
        unsigned ADACT4                 :1;
    };
} ADACTbits_t;
extern volatile ADACTbits_t ADACTbits __at(0x099);
// bitfield macros
#define _ADACT_ADACT_POSN                                   0x0
#define _ADACT_ADACT_POSITION                               0x0
#define _ADACT_ADACT_SIZE                                   0x5
#define _ADACT_ADACT_LENGTH                                 0x5
#define _ADACT_ADACT_MASK                                   0x1F
#define _ADACT_ADACT0_POSN                                  0x0
#define _ADACT_ADACT0_POSITION                              0x0
#define _ADACT_ADACT0_SIZE                                  0x1
#define _ADACT_ADACT0_LENGTH                                0x1
#define _ADACT_ADACT0_MASK                                  0x1
#define _ADACT_ADACT1_POSN                                  0x1
#define _ADACT_ADACT1_POSITION                              0x1
#define _ADACT_ADACT1_SIZE                                  0x1
#define _ADACT_ADACT1_LENGTH                                0x1
#define _ADACT_ADACT1_MASK                                  0x2
#define _ADACT_ADACT2_POSN                                  0x2
#define _ADACT_ADACT2_POSITION                              0x2
#define _ADACT_ADACT2_SIZE                                  0x1
#define _ADACT_ADACT2_LENGTH                                0x1
#define _ADACT_ADACT2_MASK                                  0x4
#define _ADACT_ADACT3_POSN                                  0x3
#define _ADACT_ADACT3_POSITION                              0x3
#define _ADACT_ADACT3_SIZE                                  0x1
#define _ADACT_ADACT3_LENGTH                                0x1
#define _ADACT_ADACT3_MASK                                  0x8
#define _ADACT_ADACT4_POSN                                  0x4
#define _ADACT_ADACT4_POSITION                              0x4
#define _ADACT_ADACT4_SIZE                                  0x1
#define _ADACT_ADACT4_LENGTH                                0x1
#define _ADACT_ADACT4_MASK                                  0x10

// Register: ADREF
#define ADREF ADREF
extern volatile unsigned char           ADREF               __at(0x09A);
#ifndef _LIB_BUILD
asm("ADREF equ 09Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADPREF                 :2;
        unsigned                        :2;
        unsigned ADNREF                 :1;
    };
    struct {
        unsigned ADPREF0                :1;
        unsigned ADPREF1                :1;
    };
} ADREFbits_t;
extern volatile ADREFbits_t ADREFbits __at(0x09A);
// bitfield macros
#define _ADREF_ADPREF_POSN                                  0x0
#define _ADREF_ADPREF_POSITION                              0x0
#define _ADREF_ADPREF_SIZE                                  0x2
#define _ADREF_ADPREF_LENGTH                                0x2
#define _ADREF_ADPREF_MASK                                  0x3
#define _ADREF_ADNREF_POSN                                  0x4
#define _ADREF_ADNREF_POSITION                              0x4
#define _ADREF_ADNREF_SIZE                                  0x1
#define _ADREF_ADNREF_LENGTH                                0x1
#define _ADREF_ADNREF_MASK                                  0x10
#define _ADREF_ADPREF0_POSN                                 0x0
#define _ADREF_ADPREF0_POSITION                             0x0
#define _ADREF_ADPREF0_SIZE                                 0x1
#define _ADREF_ADPREF0_LENGTH                               0x1
#define _ADREF_ADPREF0_MASK                                 0x1
#define _ADREF_ADPREF1_POSN                                 0x1
#define _ADREF_ADPREF1_POSITION                             0x1
#define _ADREF_ADPREF1_SIZE                                 0x1
#define _ADREF_ADPREF1_LENGTH                               0x1
#define _ADREF_ADPREF1_MASK                                 0x2

// Register: ADCAP
#define ADCAP ADCAP
extern volatile unsigned char           ADCAP               __at(0x09B);
#ifndef _LIB_BUILD
asm("ADCAP equ 09Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCAP                  :5;
    };
    struct {
        unsigned ADCAP0                 :1;
        unsigned ADCAP1                 :1;
        unsigned ADCAP2                 :1;
        unsigned ADCAP3                 :1;
        unsigned ADCAP4                 :1;
    };
} ADCAPbits_t;
extern volatile ADCAPbits_t ADCAPbits __at(0x09B);
// bitfield macros
#define _ADCAP_ADCAP_POSN                                   0x0
#define _ADCAP_ADCAP_POSITION                               0x0
#define _ADCAP_ADCAP_SIZE                                   0x5
#define _ADCAP_ADCAP_LENGTH                                 0x5
#define _ADCAP_ADCAP_MASK                                   0x1F
#define _ADCAP_ADCAP0_POSN                                  0x0
#define _ADCAP_ADCAP0_POSITION                              0x0
#define _ADCAP_ADCAP0_SIZE                                  0x1
#define _ADCAP_ADCAP0_LENGTH                                0x1
#define _ADCAP_ADCAP0_MASK                                  0x1
#define _ADCAP_ADCAP1_POSN                                  0x1
#define _ADCAP_ADCAP1_POSITION                              0x1
#define _ADCAP_ADCAP1_SIZE                                  0x1
#define _ADCAP_ADCAP1_LENGTH                                0x1
#define _ADCAP_ADCAP1_MASK                                  0x2
#define _ADCAP_ADCAP2_POSN                                  0x2
#define _ADCAP_ADCAP2_POSITION                              0x2
#define _ADCAP_ADCAP2_SIZE                                  0x1
#define _ADCAP_ADCAP2_LENGTH                                0x1
#define _ADCAP_ADCAP2_MASK                                  0x4
#define _ADCAP_ADCAP3_POSN                                  0x3
#define _ADCAP_ADCAP3_POSITION                              0x3
#define _ADCAP_ADCAP3_SIZE                                  0x1
#define _ADCAP_ADCAP3_LENGTH                                0x1
#define _ADCAP_ADCAP3_MASK                                  0x8
#define _ADCAP_ADCAP4_POSN                                  0x4
#define _ADCAP_ADCAP4_POSITION                              0x4
#define _ADCAP_ADCAP4_SIZE                                  0x1
#define _ADCAP_ADCAP4_LENGTH                                0x1
#define _ADCAP_ADCAP4_MASK                                  0x10

// Register: ADPRE
#define ADPRE ADPRE
extern volatile unsigned char           ADPRE               __at(0x09C);
#ifndef _LIB_BUILD
asm("ADPRE equ 09Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADPRE                  :8;
    };
    struct {
        unsigned ADPRE0                 :1;
        unsigned ADPRE1                 :1;
        unsigned ADPRE2                 :1;
        unsigned ADPRE3                 :1;
        unsigned ADPRE4                 :1;
        unsigned ADPRE5                 :1;
        unsigned ADPRE6                 :1;
        unsigned ADPRE7                 :1;
    };
} ADPREbits_t;
extern volatile ADPREbits_t ADPREbits __at(0x09C);
// bitfield macros
#define _ADPRE_ADPRE_POSN                                   0x0
#define _ADPRE_ADPRE_POSITION                               0x0
#define _ADPRE_ADPRE_SIZE                                   0x8
#define _ADPRE_ADPRE_LENGTH                                 0x8
#define _ADPRE_ADPRE_MASK                                   0xFF
#define _ADPRE_ADPRE0_POSN                                  0x0
#define _ADPRE_ADPRE0_POSITION                              0x0
#define _ADPRE_ADPRE0_SIZE                                  0x1
#define _ADPRE_ADPRE0_LENGTH                                0x1
#define _ADPRE_ADPRE0_MASK                                  0x1
#define _ADPRE_ADPRE1_POSN                                  0x1
#define _ADPRE_ADPRE1_POSITION                              0x1
#define _ADPRE_ADPRE1_SIZE                                  0x1
#define _ADPRE_ADPRE1_LENGTH                                0x1
#define _ADPRE_ADPRE1_MASK                                  0x2
#define _ADPRE_ADPRE2_POSN                                  0x2
#define _ADPRE_ADPRE2_POSITION                              0x2
#define _ADPRE_ADPRE2_SIZE                                  0x1
#define _ADPRE_ADPRE2_LENGTH                                0x1
#define _ADPRE_ADPRE2_MASK                                  0x4
#define _ADPRE_ADPRE3_POSN                                  0x3
#define _ADPRE_ADPRE3_POSITION                              0x3
#define _ADPRE_ADPRE3_SIZE                                  0x1
#define _ADPRE_ADPRE3_LENGTH                                0x1
#define _ADPRE_ADPRE3_MASK                                  0x8
#define _ADPRE_ADPRE4_POSN                                  0x4
#define _ADPRE_ADPRE4_POSITION                              0x4
#define _ADPRE_ADPRE4_SIZE                                  0x1
#define _ADPRE_ADPRE4_LENGTH                                0x1
#define _ADPRE_ADPRE4_MASK                                  0x10
#define _ADPRE_ADPRE5_POSN                                  0x5
#define _ADPRE_ADPRE5_POSITION                              0x5
#define _ADPRE_ADPRE5_SIZE                                  0x1
#define _ADPRE_ADPRE5_LENGTH                                0x1
#define _ADPRE_ADPRE5_MASK                                  0x20
#define _ADPRE_ADPRE6_POSN                                  0x6
#define _ADPRE_ADPRE6_POSITION                              0x6
#define _ADPRE_ADPRE6_SIZE                                  0x1
#define _ADPRE_ADPRE6_LENGTH                                0x1
#define _ADPRE_ADPRE6_MASK                                  0x40
#define _ADPRE_ADPRE7_POSN                                  0x7
#define _ADPRE_ADPRE7_POSITION                              0x7
#define _ADPRE_ADPRE7_SIZE                                  0x1
#define _ADPRE_ADPRE7_LENGTH                                0x1
#define _ADPRE_ADPRE7_MASK                                  0x80

// Register: ADACQ
#define ADACQ ADACQ
extern volatile unsigned char           ADACQ               __at(0x09D);
#ifndef _LIB_BUILD
asm("ADACQ equ 09Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADACQ                  :8;
    };
    struct {
        unsigned ADACQ0                 :1;
        unsigned ADACQ1                 :1;
        unsigned ADACQ2                 :1;
        unsigned ADACQ3                 :1;
        unsigned ADACQ4                 :1;
        unsigned ADACQ5                 :1;
        unsigned ADACQ6                 :1;
        unsigned ADACQ7                 :1;
    };
} ADACQbits_t;
