MikroElektronika/core_packages/PIC/XC8/def/PIC16LF18877/mcu.h
extern volatile CWG3CON1bits_t CWG3CON1bits __at(0x691);
// bitfield macros
#define _CWG3CON1_POLA_POSN                                 0x0
#define _CWG3CON1_POLA_POSITION                             0x0
#define _CWG3CON1_POLA_SIZE                                 0x1
#define _CWG3CON1_POLA_LENGTH                               0x1
#define _CWG3CON1_POLA_MASK                                 0x1
#define _CWG3CON1_POLB_POSN                                 0x1
#define _CWG3CON1_POLB_POSITION                             0x1
#define _CWG3CON1_POLB_SIZE                                 0x1
#define _CWG3CON1_POLB_LENGTH                               0x1
#define _CWG3CON1_POLB_MASK                                 0x2
#define _CWG3CON1_POLC_POSN                                 0x2
#define _CWG3CON1_POLC_POSITION                             0x2
#define _CWG3CON1_POLC_SIZE                                 0x1
#define _CWG3CON1_POLC_LENGTH                               0x1
#define _CWG3CON1_POLC_MASK                                 0x4
#define _CWG3CON1_POLD_POSN                                 0x3
#define _CWG3CON1_POLD_POSITION                             0x3
#define _CWG3CON1_POLD_SIZE                                 0x1
#define _CWG3CON1_POLD_LENGTH                               0x1
#define _CWG3CON1_POLD_MASK                                 0x8
#define _CWG3CON1_IN_POSN                                   0x5
#define _CWG3CON1_IN_POSITION                               0x5
#define _CWG3CON1_IN_SIZE                                   0x1
#define _CWG3CON1_IN_LENGTH                                 0x1
#define _CWG3CON1_IN_MASK                                   0x20
#define _CWG3CON1_CWG3POLA_POSN                             0x0
#define _CWG3CON1_CWG3POLA_POSITION                         0x0
#define _CWG3CON1_CWG3POLA_SIZE                             0x1
#define _CWG3CON1_CWG3POLA_LENGTH                           0x1
#define _CWG3CON1_CWG3POLA_MASK                             0x1
#define _CWG3CON1_CWG3POLB_POSN                             0x1
#define _CWG3CON1_CWG3POLB_POSITION                         0x1
#define _CWG3CON1_CWG3POLB_SIZE                             0x1
#define _CWG3CON1_CWG3POLB_LENGTH                           0x1
#define _CWG3CON1_CWG3POLB_MASK                             0x2
#define _CWG3CON1_CWG3POLC_POSN                             0x2
#define _CWG3CON1_CWG3POLC_POSITION                         0x2
#define _CWG3CON1_CWG3POLC_SIZE                             0x1
#define _CWG3CON1_CWG3POLC_LENGTH                           0x1
#define _CWG3CON1_CWG3POLC_MASK                             0x4
#define _CWG3CON1_CWG3POLD_POSN                             0x3
#define _CWG3CON1_CWG3POLD_POSITION                         0x3
#define _CWG3CON1_CWG3POLD_SIZE                             0x1
#define _CWG3CON1_CWG3POLD_LENGTH                           0x1
#define _CWG3CON1_CWG3POLD_MASK                             0x8
#define _CWG3CON1_CWG3IN_POSN                               0x5
#define _CWG3CON1_CWG3IN_POSITION                           0x5
#define _CWG3CON1_CWG3IN_SIZE                               0x1
#define _CWG3CON1_CWG3IN_LENGTH                             0x1
#define _CWG3CON1_CWG3IN_MASK                               0x20

// Register: CWG3AS0
#define CWG3AS0 CWG3AS0
extern volatile unsigned char           CWG3AS0             __at(0x692);
#ifndef _LIB_BUILD
asm("CWG3AS0 equ 0692h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned LSAC                   :2;
        unsigned LSBD                   :2;
        unsigned REN                    :1;
        unsigned SHUTDOWN               :1;
    };
    struct {
        unsigned                        :2;
        unsigned LSAC0                  :1;
        unsigned LSAC1                  :1;
        unsigned LSBD0                  :1;
        unsigned LSBD1                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned CWG3LSAC               :2;
        unsigned CWG3LSBD               :2;
        unsigned CWG3REN                :1;
        unsigned CWG3SHUTDOWN           :1;
    };
    struct {
        unsigned                        :2;
        unsigned CWG3LSAC0              :1;
        unsigned CWG3LSAC1              :1;
        unsigned CWG3LSBD0              :1;
        unsigned CWG3LSBD1              :1;
    };
} CWG3AS0bits_t;
extern volatile CWG3AS0bits_t CWG3AS0bits __at(0x692);
// bitfield macros
#define _CWG3AS0_LSAC_POSN                                  0x2
#define _CWG3AS0_LSAC_POSITION                              0x2
#define _CWG3AS0_LSAC_SIZE                                  0x2
#define _CWG3AS0_LSAC_LENGTH                                0x2
#define _CWG3AS0_LSAC_MASK                                  0xC
#define _CWG3AS0_LSBD_POSN                                  0x4
#define _CWG3AS0_LSBD_POSITION                              0x4
#define _CWG3AS0_LSBD_SIZE                                  0x2
#define _CWG3AS0_LSBD_LENGTH                                0x2
#define _CWG3AS0_LSBD_MASK                                  0x30
#define _CWG3AS0_REN_POSN                                   0x6
#define _CWG3AS0_REN_POSITION                               0x6
#define _CWG3AS0_REN_SIZE                                   0x1
#define _CWG3AS0_REN_LENGTH                                 0x1
#define _CWG3AS0_REN_MASK                                   0x40
#define _CWG3AS0_SHUTDOWN_POSN                              0x7
#define _CWG3AS0_SHUTDOWN_POSITION                          0x7
#define _CWG3AS0_SHUTDOWN_SIZE                              0x1
#define _CWG3AS0_SHUTDOWN_LENGTH                            0x1
#define _CWG3AS0_SHUTDOWN_MASK                              0x80
#define _CWG3AS0_LSAC0_POSN                                 0x2
#define _CWG3AS0_LSAC0_POSITION                             0x2
#define _CWG3AS0_LSAC0_SIZE                                 0x1
#define _CWG3AS0_LSAC0_LENGTH                               0x1
#define _CWG3AS0_LSAC0_MASK                                 0x4
#define _CWG3AS0_LSAC1_POSN                                 0x3
#define _CWG3AS0_LSAC1_POSITION                             0x3
#define _CWG3AS0_LSAC1_SIZE                                 0x1
#define _CWG3AS0_LSAC1_LENGTH                               0x1
#define _CWG3AS0_LSAC1_MASK                                 0x8
#define _CWG3AS0_LSBD0_POSN                                 0x4
#define _CWG3AS0_LSBD0_POSITION                             0x4
#define _CWG3AS0_LSBD0_SIZE                                 0x1
#define _CWG3AS0_LSBD0_LENGTH                               0x1
#define _CWG3AS0_LSBD0_MASK                                 0x10
#define _CWG3AS0_LSBD1_POSN                                 0x5
#define _CWG3AS0_LSBD1_POSITION                             0x5
#define _CWG3AS0_LSBD1_SIZE                                 0x1
#define _CWG3AS0_LSBD1_LENGTH                               0x1
#define _CWG3AS0_LSBD1_MASK                                 0x20
#define _CWG3AS0_CWG3LSAC_POSN                              0x2
#define _CWG3AS0_CWG3LSAC_POSITION                          0x2
#define _CWG3AS0_CWG3LSAC_SIZE                              0x2
#define _CWG3AS0_CWG3LSAC_LENGTH                            0x2
#define _CWG3AS0_CWG3LSAC_MASK                              0xC
#define _CWG3AS0_CWG3LSBD_POSN                              0x4
#define _CWG3AS0_CWG3LSBD_POSITION                          0x4
#define _CWG3AS0_CWG3LSBD_SIZE                              0x2
#define _CWG3AS0_CWG3LSBD_LENGTH                            0x2
#define _CWG3AS0_CWG3LSBD_MASK                              0x30
#define _CWG3AS0_CWG3REN_POSN                               0x6
#define _CWG3AS0_CWG3REN_POSITION                           0x6
#define _CWG3AS0_CWG3REN_SIZE                               0x1
#define _CWG3AS0_CWG3REN_LENGTH                             0x1
#define _CWG3AS0_CWG3REN_MASK                               0x40
#define _CWG3AS0_CWG3SHUTDOWN_POSN                          0x7
#define _CWG3AS0_CWG3SHUTDOWN_POSITION                      0x7
#define _CWG3AS0_CWG3SHUTDOWN_SIZE                          0x1
#define _CWG3AS0_CWG3SHUTDOWN_LENGTH                        0x1
#define _CWG3AS0_CWG3SHUTDOWN_MASK                          0x80
#define _CWG3AS0_CWG3LSAC0_POSN                             0x2
#define _CWG3AS0_CWG3LSAC0_POSITION                         0x2
#define _CWG3AS0_CWG3LSAC0_SIZE                             0x1
#define _CWG3AS0_CWG3LSAC0_LENGTH                           0x1
#define _CWG3AS0_CWG3LSAC0_MASK                             0x4
#define _CWG3AS0_CWG3LSAC1_POSN                             0x3
#define _CWG3AS0_CWG3LSAC1_POSITION                         0x3
#define _CWG3AS0_CWG3LSAC1_SIZE                             0x1
#define _CWG3AS0_CWG3LSAC1_LENGTH                           0x1
#define _CWG3AS0_CWG3LSAC1_MASK                             0x8
#define _CWG3AS0_CWG3LSBD0_POSN                             0x4
#define _CWG3AS0_CWG3LSBD0_POSITION                         0x4
#define _CWG3AS0_CWG3LSBD0_SIZE                             0x1
#define _CWG3AS0_CWG3LSBD0_LENGTH                           0x1
#define _CWG3AS0_CWG3LSBD0_MASK                             0x10
#define _CWG3AS0_CWG3LSBD1_POSN                             0x5
#define _CWG3AS0_CWG3LSBD1_POSITION                         0x5
#define _CWG3AS0_CWG3LSBD1_SIZE                             0x1
#define _CWG3AS0_CWG3LSBD1_LENGTH                           0x1
#define _CWG3AS0_CWG3LSBD1_MASK                             0x20

// Register: CWG3AS1
#define CWG3AS1 CWG3AS1
extern volatile unsigned char           CWG3AS1             __at(0x693);
#ifndef _LIB_BUILD
asm("CWG3AS1 equ 0693h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AS0E                   :1;
        unsigned AS1E                   :1;
        unsigned AS2E                   :1;
        unsigned AS3E                   :1;
        unsigned AS4E                   :1;
        unsigned AS5E                   :1;
        unsigned AS6E                   :1;
    };
} CWG3AS1bits_t;
